#### 📖 Terraform Plan ('src/common/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_web_app.app_backendl2: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
data.azurerm_linux_web_app.app_backendl1: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
data.azurerm_linux_web_app.app_backendl2: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [20s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager: Still reading... [20s elapsed]
data.azurerm_linux_web_app.app_backendl1: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.application_gateway_weu.azurerm_key_vault_access_policy.app_gateway_policy will be created
  + resource "azurerm_key_vault_access_policy" "app_gateway_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-kv"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.application_gateway_weu.azurerm_key_vault_access_policy.app_gateway_policy_common will be created
  + resource "azurerm_key_vault_access_policy" "app_gateway_policy_common" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.application_gateway_weu.azurerm_key_vault_access_policy.app_gateway_policy_ioweb will be created
  + resource "azurerm_key_vault_access_policy" "app_gateway_policy_ioweb" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-ioweb-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-ioweb-kv"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.application_gateway_weu.azurerm_key_vault_access_policy.app_gw_uai_kvreader_common will be created
  + resource "azurerm_key_vault_access_policy" "app_gw_uai_kvreader_common" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + object_id               = "ef7e473e-41eb-4f7f-b37c-730d02882cb2"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.application_gateway_weu.azurerm_public_ip.appgateway_public_ip will be created
  + resource "azurerm_public_ip" "appgateway_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "io-p-appgateway-pip"
      + resource_group_name     = "io-p-rg-external"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.application_gateway_weu.azurerm_user_assigned_identity.appgateway will be created
  + resource "azurerm_user_assigned_identity" "appgateway" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "io-p-appgateway-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "io-p-sec-rg"
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + tenant_id           = (known after apply)
    }

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be created
  + resource "azurerm_web_application_firewall_policy" "api_app" {
      + http_listener_ids   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "io-p-waf-appgateway-api-app-policy"
      + path_based_rule_ids = (known after apply)
      + resource_group_name = "io-p-rg-external"
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }

      + managed_rules {
          + managed_rule_set {
              + type    = "OWASP"
              + version = "3.1"

              + rule_group_override {
                  + disabled_rules  = [
                      + "913100",
                      + "913101",
                      + "913102",
                      + "913110",
                      + "913120",
                    ]
                  + rule_group_name = "REQUEST-913-SCANNER-DETECTION"
                }
              + rule_group_override {
                  + disabled_rules  = [
                      + "920300",
                      + "920320",
                    ]
                  + rule_group_name = "REQUEST-920-PROTOCOL-ENFORCEMENT"
                }
              + rule_group_override {
                  + disabled_rules  = [
                      + "930120",
                    ]
                  + rule_group_name = "REQUEST-930-APPLICATION-ATTACK-LFI"
                }
              + rule_group_override {
       
Error: Unsupported attribute

  on westeurope.tf line 13, in module "event_hubs_weu":
  13:   servicebus_dns_zone   = local.core.global.dns.private_dns_zones.servicebus
    ├────────────────
    │ local.core is object with 2 attributes

This object does not have an attribute named "global".

Error: Unsupported attribute

  on westeurope.tf line 56, in module "application_gateway_weu":
  56:   external_domain  = local.core.global.dns.external_domain
    ├────────────────
    │ local.core is object with 2 attributes

This object does not have an attribute named "global".

Error: Unsupported attribute

  on westeurope.tf line 57, in module "application_gateway_weu":
  57:   public_dns_zones = local.core.global.dns.public_dns_zones
    ├────────────────
    │ local.core is object with 2 attributes

This object does not have an attribute named "global".
           + disabled_rules  = [
                      + "932150",
                    ]
                  + rule_group_name = "REQUEST-932-APPLICATION-ATTACK-RCE"
                }
              + rule_group_override {
                  + disabled_rules  = [
                      + "941130",
                    ]
                  + rule_group_name = "REQUEST-941-APPLICATION-ATTACK-XSS"
                }
              + rule_group_override {
                  + disabled_rules  = [
                      + "942100",
                      + "942120",
                      + "942190",
                      + "942200",
                      + "942210",
                      + "942240",
                      + "942250",
                      + "942260",
                      + "942330",
                      + "942340",
                      + "942370",
                      + "942380",
                      + "942430",
                      + "942440",
                      + "942450",
                    ]
                  + rule_group_name = "REQUEST-942-APPLICATION-ATTACK-SQLI"
                }
            }
        }

      + policy_settings {
          + enabled                          = true
          + file_upload_limit_in_mb          = 100
          + max_request_body_size_in_kb      = 128
          + mode                             = "Prevention"
          + request_body_check               = true
          + request_body_inspect_limit_in_kb = 128
        }
    }

  # module.application_gateway_weu.module.appgateway_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.0.13.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-appgateway-snet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "io-p-rg-common"
      + service_endpoints                              = [
          + "Microsoft.Web",
        ]
      + virtual_network_name                           = "io-p-vnet-common"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app,
  on ../_modules/application_gateway/firewall.tf line 62, in resource "azurerm_web_application_firewall_policy" "api_app":
  62:         disabled_rules = [
  63:           "942100",
  64:           "942120",
  65:           "942190",
  66:           "942200",
  67:           "942210",
  68:           "942240",
  69:           "942250",
  70:           "942260",
  71:           "942330",
  72:           "942340",
  73:           "942370",
  74:           "942380",
  75:           "942430",
  76:           "942440",
  77:           "942450",
  78:         ]

`disabled_rules` will be removed in favour of the `rule` property in version
4.0 of the AzureRM Provider.

(and 18 more similar warnings elsewhere)
::error::Terraform exited with code 1.
```

</details>
